import styles from "./styles.module.css";
import Heading from "@theme/Heading";

const HomepageWelcome = () => {
  return (
    <section className={styles.welcome}>
      <div className="container">
        <Heading as="h2" className="text--center">
          Добро пожаловать
        </Heading>
        <p>
          Данный сайт содержит информацию о mesh сетях на базе LoRa в Иванове.
          Более подробную информацию вы можете найти в разделе{" "}
          <a href="/docs/">Документация</a>.
        </p>
        <p>
          В данный момент сайт находится в стадии разработки, поэтому просим
          понять и простить. Вы всегда можете помочь в развитии сайта на{" "}
          <a href="https://github.com/NFFY88/mesh37" target="_blank">
            GitHub
          </a>
          .
        </p>
      </div>

      <div className="container margin-vert--lg">
        <div className={styles.info}>
          <Heading as="h2" className="text--center">
            Тестовый переход на MediumFast
          </Heading>
          <p>
            <strong>Внимание!</strong> В период с{" "}
            <strong>8 по 18 октября 2026 года</strong> в тестовом режиме мы
            будем частично переводить Meshtastic на пресет{" "}
            <strong>MediumFast</strong>. Частота и остальные настройки при этом
            не меняются. В данный период времени вы можете столкнуться с
            проблемами в работе сети, поэтому просим вас быть внимательными и
            сообщать о любых проблемах в нашем{" "}
            <a href="https://t.me/meshtastic37">Telegram-чате</a> или в общем
            канале Meshtastic.
          </p>
          <Heading as="h3" className="text--center">
            Что это значит?
          </Heading>
          <p>
            В данный период времени мы будем тестировать пресет MediumFast,
            который позволяет увеличить скорость связи в сети Meshtastic.
            Однако, при этом немного уменьшается дальность передачи данных.
          </p>
          <Heading as="h3" className="text--center">
            Зачем это нужно?
          </Heading>
          <p>
            Сейчас мы наблюдаем загруженность канала у отдельных нод и
            периодические потери пакетов. Мы хотим понять, поможет ли переход на
            MediumFast в решении данной проблемы и стоит ли его использовать в
            будущем. Мы будем собирать данные о работе сети и анализировать их,
            чтобы принять решение о дальнейшем использовании данного пресета.
          </p>
          <Heading as="h3" className="text--center">
            Я тоже хочу попробовать, что мне для этого нужно?
          </Heading>
          <p>
            Если вы хотите попробовать пресет MediumFast, то вам нужно будет
            установить его в настройках вашей ноды вместо LongFast, сохранить и
            перезагрузить ноду. Больше ничего делать не нужно. Если захотите
            вернуться на LongFast, то просто установите его в настройках вашей
            ноды вместо MediumFast, сохраните и перезагрузите ноду. После этого
            вы снова сможете общаться с другими нодами на LongFast.
          </p>
          <Heading as="h3" className="text--center">
            Я перешел на MediumFast, но у меня пропала связь с другими нодами,
            что делать?
          </Heading>
          <p>
            Это нормально, так как в данный период времени не все ноды будут
            использовать MediumFast, а связь между нодами с разными пресетами
            невозможна. Поэтому, если вы перешли на MediumFast, то вы сможете
            общаться только с теми нодами, которые также используют данный
            пресет. Также в отдельных районах может не быть покрытия, т.к.
            ближайшие ноды остались на LongFast.
          </p>
          <Heading as="h3" className="text--center">
            Я остался на LongFast, но у меня пропала связь с другими нодами, что
            делать?
          </Heading>
          <p>
            Скорее всего ближайшие к Вам ноды перешли на MediumFast, поэтому
            цепочка ретрансляций разорвалась. Вы можете подождать конца
            тестового периода, чтобы остальные вернулись на LongFast, либо перейти на
            MediumFast, чтобы восстановить связь с другими нодами.
          </p>
        </div>
      </div>
    </section>
  );
};

export default HomepageWelcome;
